Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС21</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ОбменССайтомПовтИсп/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОбменССайтомПовтИсп: механизм обмена с сайтом
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает список узлов плана обмена в которых будут регистрироваться товары, заказы.
//
// Параметры:
//  ОбменТоварами - Булево - признак обмена товарами узла плана обмена.
//  ОбменЗаказами - Булево - признак обмена заказами узла плана обмена.
// 
// Возвращаемое значение:
//  Массив - список узлов планов обмена.
//
Функция МассивУзловДляРегистрации(ОбменТоварами = Ложь, ОбменЗаказами = Ложь) Экспорт
	
	МассивУзлов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбменССайтом.Ссылка КАК Узел
	|ИЗ
	|	ПланОбмена.ОбменССайтом КАК ОбменССайтом
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОбменТоварами
	|				ТОГДА ОбменССайтом.ОбменТоварами
	|			КОГДА &ОбменЗаказами
	|				ТОГДА ОбменССайтом.ОбменЗаказами
	|		КОНЕЦ
	|	И НЕ ОбменССайтом.Ссылка = &ЭтотУзел";
	Запрос.УстановитьПараметр("ОбменТоварами", ОбменТоварами);
	Запрос.УстановитьПараметр("ОбменЗаказами", ОбменЗаказами);
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменССайтом.ЭтотУзел());
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивУзлов.Добавить(Выборка.Узел);
	КонецЦикла;
	
	Возврат МассивУзлов;
	
КонецФункции

// Выполняет поиск валюты по строковому коду, полученному из XML.
//
// Параметры:
//	КодВалютыСтрока - Cтрока - код валюты
//
// Возвращаемое значение:
//	СправочникСсылка.Валюты - найденная валюта.
//
Функция ОбработатьВалютуXML(КодВалютыСтрока) Экспорт
	
	Валюта = Справочники.Валюты.НайтиПоНаименованию(КодВалютыСтрока);
	
	Если НЕ ЗначениеЗаполнено(Валюта) Тогда
		Валюта = Константы.ВалютаУчета.Получить();
	КонецЕсли;
		
	Возврат Валюта;
	
КонецФункции

// Получает ставку НДС по значению XML.
//
// Параметры:
//	ЗначениеНалога - строка
//	Организация - СправочникСсылка.Организации
// 
// Возвращаемое значение:
//	СправочникСсылка.СтавкиНДС.
//
Функция ПолучитьПоЗначениюДляВыгрузкиСтавкуНДС(ЗначениеНалога) Экспорт
	
	Ставка = 0;
	
	Если ЗначениеНалога = "0" ИЛИ ЗначениеНалога = "0.00" Тогда
		Ставка = Перечисления.СтавкиНДС.НДС0;
	ИначеЕсли ЗначениеНалога = "10" ИЛИ ЗначениеНалога = "10.00" Тогда
		Ставка = Перечисления.СтавкиНДС.НДС10;
	ИначеЕсли ЗначениеНалога = "10/110" Тогда
		Ставка = Перечисления.СтавкиНДС.НДС10;
	ИначеЕсли ЗначениеНалога = "18" ИЛИ ЗначениеНалога = "18.00" Тогда
		Ставка = Перечисления.СтавкиНДС.НДС18;
	ИначеЕсли ЗначениеНалога = "18/118" Тогда
		Ставка = Перечисления.СтавкиНДС.НДС18;
	ИначеЕсли ЗначениеНалога = "20" ИЛИ ЗначениеНалога = "20.00" Тогда
		Ставка = Перечисления.СтавкиНДС.НДС20;
	ИначеЕсли ЗначениеНалога = "20/120" Тогда
		Ставка = Перечисления.СтавкиНДС.НДС20;
	ИначеЕсли ЗначениеНалога = "22" ИЛИ ЗначениеНалога = "22.00" Тогда
		Ставка = Перечисления.СтавкиНДС.НДС22;
	ИначеЕсли ЗначениеНалога = "22/122" Тогда
		Ставка = Перечисления.СтавкиНДС.НДС22;	
	ИначеЕсли ЗначениеНалога = "5/105" Тогда
		Ставка = Перечисления.СтавкиНДС.НДС5; 
	ИначеЕсли ЗначениеНалога = "5" ИЛИ ЗначениеНалога = "5.00" Тогда
		Ставка = Перечисления.СтавкиНДС.НДС5;	
	ИначеЕсли ЗначениеНалога = "7" ИЛИ ЗначениеНалога = "7.00" Тогда
		Ставка = Перечисления.СтавкиНДС.НДС7;
	ИначеЕсли ЗначениеНалога = "7/107" Тогда
		Ставка = Перечисления.СтавкиНДС.НДС7;	
	Иначе
		Ставка = Перечисления.СтавкиНДС.БезНДС;
	КонецЕсли;
	
	Возврат Ставка;
	
КонецФункции

#КонецОбласти
